<!doctype html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <title>Document</title>
</head>
<body  style="text-align: center;">
    <h1>Простые переменные</h1>

    <div style="display: inline-block; text-align: left;">
        <?php
        $var1 = 123;
        $var2 = 456.789;
        $var3 = 'asd';
        $var4 = 'qwer';
        ?>

        <p>Переменная <b>$var1</b> равна числу <b><?= $var1 ?></b></p>

        <p>Переменная <b>$var2</b> равна числу <b><?= $var2 ?></b></p>

        <p>Переменная <b>$var3</b> равна строке <b><?= $var3 ?></b></p>

        <p>Переменная <b>$var4</b> равна строке <b><?= $var4 ?></b></p>

        <p>Подробная информация о значении переменной <b>$var1</b>: <?php var_dump($var1) ?></p>

        <p>Подробная информация о значении переменной <b>$var2</b>: <?php var_dump($var2) ?></p>

        <p>Подробная информация о значении переменной <b>$var3</b>: <?php var_dump($var3) ?></p>

        <p>Подробная информация о значении переменной <b>$var4</b>: <?php var_dump($var4) ?></p>

        <p>Результат выражения <b>($var1 + $var2) * 2</b> равен <b><?= ($var1 + $var2) * 2 ?></b></p>

        <p>Результат выражения <b>$var3 . $var4 . 'zxc'</b> равен <b><?= $var3 . $var4 . 'xzc' ?></b></p>

        <p>Результат сложения строки с числом <b>$var3 + $var1</b> равен числу <b><?= $var3 + $var1 ?></b></p>

        <p>Результат конкатенации строки с числом <b>$var3 . $var1</b> равен строке <b><?= $var3 . $var1 ?></b></p>

        <p>Результат конкатенации числа с числом <b>$var1 . $var2</b> равен строке <b><?= $var1 . $var2 ?></b></p>

        <?php $var3 = '10asd' ?>

        <p>Переменная <b>$var3</b> теперь равна строке <b><?= $var3 ?></b></p>

        <p>Результат сложения строки с числом <b>$var3 + $var1</b> равен числу <b><?= $var3 + $var1 ?></b></p>

        <?php $var4 = 100 ?>

        <p>Переменная <b>$var4</b> была равна строке, а теперь равна числу <b><?php var_dump($var4) ?></b></p>
    </div>
</body>
</html>